Белгипрозем_2017/src/Documents/мРеализация/мРеализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мРеализация</name>
  <registerRecords>AccumulationRegister.УчетПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.УчетДоговоров</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодБланка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.мСостоянияАктовВыполненныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>НоменклатураПроизводства</name>
      <type>
        <types>CatalogRef.мНоменклатураПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Калькуляция</name>
      <type>
        <types>DocumentRef.мКалькуляция</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.мСтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсвобождениеОтНДС</name>
      <type>
        <types>CatalogRef.мОсвобождениеОтНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Documents/мРеализация/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	мРеализацияНоменклатура.Ссылка.Дата КАК Период,
		|	мРеализацияНоменклатура.НоменклатураПроизводства,
		|	мРеализацияНоменклатура.Калькуляция,
		|	мРеализацияНоменклатура.Количество,
		|	мРеализацияНоменклатура.НДС,
		|	мРеализацияНоменклатура.Всего КАК Сумма,
		|	мРеализацияНоменклатура.Ссылка.Договор,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора
		|ИЗ
		|	Документ.мРеализация.Номенклатура КАК мРеализацияНоменклатура
		|ГДЕ
		|	мРеализацияНоменклатура.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(мРеализацияНоменклатура.Всего) КАК Сумма,
		|	СУММА(мРеализацияНоменклатура.НДС) КАК НДС,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	мРеализацияНоменклатура.Ссылка,
		|	мРеализацияНоменклатура.Ссылка.Дата КАК Период,
		|	мРеализацияНоменклатура.Ссылка.Корреспондент,
		|	мРеализацияНоменклатура.Ссылка.Договор,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора.СтавкаНДС КАК СтавкаНДС,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
		|	мРеализацияНоменклатура.Ссылка.Дата КАК ДатаДокумента,
		|	мРеализацияНоменклатура.Ссылка.НомерТТН как НомерДокумента
		|ИЗ
		|	Документ.мРеализация.Номенклатура КАК мРеализацияНоменклатура
		|ГДЕ
		|	мРеализацияНоменклатура.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	мРеализацияНоменклатура.Ссылка,
		|	мРеализацияНоменклатура.Ссылка.Дата,
		|	мРеализацияНоменклатура.Ссылка.Корреспондент,
		|	мРеализацияНоменклатура.Ссылка.Договор,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора.СтавкаНДС,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора.ОсвобождениеОтНДС,
		|	мРеализацияНоменклатура.Ссылка.НомерТТН";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.ВыполнитьПакет();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаНоменклатураПроизводства", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", Результат[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаУчетДоговоров", Результат[1].Выгрузить());
	
КонецПроцедуры
